Repository: Daniel-KM/Omeka-S-module-SingleSignOn
Catalog: language/*.po
Languages: fr

source: The module %1$s should be upgraded to version %2$s or later.
fr: Le module %1$s doit être mis à niveau à la version %2$s ou supérieure.

source: When the metadata url of an IdP is set, its form will be automatically filled and updated each day.
fr: Quand l’url des métadonnées de l’IdP est mise, le formulaire est automatiquement mis à jour chaque jour.

source: Warning: some IdPs hide the name, so you may fill it yourself.
fr: Attention : certains IdPs cachent le nom et vous devez donc le remplir vous-même dans ce cas.

source: Furthermore, IdP keys still need to be mapped, at least for name.
fr: En outre, les clés IdP doivent toujours être alignées, au moins pour le nom.

source: Login with your identity provider
fr: Se connecter avec son fournisseur d’identité

source: Direct login
fr: Connexion directe

source: Single Sign-On
fr: Authentification SSO

source: Create your password via your identity provider.
fr: Créez votre mot de passe via votre fournisseur d’identité.

source: Update your password via your identity provider.
fr: Mettez à jour votre mot de passe via votre fournisseur d’identité.

source: It is now possible to manage multiple IdPs.
fr: Il est désormais possible de gérer plusieurs IdP.

source: It is now possible to config and update IdPs automatically with IdP metadata url.
fr: Il est désormais possible de configurer et de mettre à jour automatiquement les IdP avec l’url des métadonnées IdP.

source: It is now possible to map IdP and Omeka roles and settings.
fr: Il est désormais possible de faire correspondre les rôles et les paramètres de l’IdP et d’Omeka.

source: It is now possible to set an IdP manually. Warning: the certificate of IdP set manually will not be updated automatically.
fr: Il est désormais possible de définir un IdP manuellement. Attention : le certificat de l’IdP défini manuellement ne sera pas mis à jour automatiquement.

source: It is now possible to force login via SSO, so to disallow local login.
fr: Il est maintenant possible de forcer la connexion via SSO, afin d’interdire la connexion locale.

source: It is now possible to define a default role.
fr: Il est désormais possible de définir un rôle par défaut.

source: The settings "heading" was removed from block Sso login links. New blocks "Heading" or "Html" were prepended to all blocks that had a filled heading. You may check pages for styles: {json}
fr: Le paramètre « heading » (titre) a été supprimé des blocs de liens de connexion Sso. De nouveaux blocs « Titre » ou « Html » ont été ajoutés à tous les blocs qui avaient un titre rempli. Vous pouvez vérifier les pages pour les styles : {json}

source: The setting "template" was moved to the new block layout settings available since Omeka S v4.1. You may check pages for styles: {json}
fr: Le paramètre « template » a été déplacé dans les nouveaux paramètres de bloc depuis Omeka S v4.1. Vous pouvez vérifier les pages pour les styles : {json}

source: The template files for the block Sso login links should be moved from "view/common/block-layout" to "view/common/block-template" in your themes. You may check your themes for pages: {json}
fr: Les fichiers de modèle pour les liens de connexion du bloc Sso doivent être déplacés de « view/common/block-layout » à « view/common/block-template » dans vos thèmes. Vous pouvez vérifier vos thèmes pour les pages : {json}

source: It is now possible to define a federation of idps like Renater instead of individual idps.
fr: Il est désormais possible de définir une fédération d’idps comme Renater au lieu d’idps individuels.

source: It is now possible to define a specific entity id (default is the url of the site).
fr: Il est désormais possible de définir une id d’entité. L’id d’entité par défaut est l’url du site.

source: It is now possible to create the x509 certificate of the SP.
fr: Il est désormais possible de créer le certificat x509 du SP.

source: It is now possible to manage IdPs with a urn as entity id.
fr: Il est désormais possible de gérer des IdPs qui utilisent une URN comme id d’entité.

source: A new option allows to replace the host domain used by Omeka as internal SP server with the host name used in public.
fr: Une nouvelle option permet de remplacer le domaine hôte utilisé par Omeka en tant que serveur SP interne par le nom d’hôte utilisé en public.

source: A new option allows to set the page to redirect after login.
fr: Une nouvelle option permet de définir la page de redirection après connexion.

source: A new option allows to set groups for new users (module Group).
fr: Une nouvelle option permet de définir les groupes pour les nouveaux utilisateurs (module Groupe).

source: A new option allows to store the certificate used to encrypt process, not only to sign in.
fr: Une nouvelle option permet de définir un certificat pour le chiffrement, pas seulement la signature.

source: Multiple signing and encryption certificates are now managed. The compatibility with Shibboleth was improved. For Shibboleth, you may need to set an encryption certificate for the sp.
fr: Plusieurs certificats de signature et de chiffrement sont désormais gérés. La compatibilité avec Shibboleth a été améliorée. Pour Shibboleth, vous pouvez avoir besoin de définir un certificat de chiffrement pour le SP.

source: To upgrade the config, you must go to the {link}config form{link_end} and submit it manually.
fr: Pour mettre à niveau la configuration, vous devez aller au {link}formulaire de config{link_end} et le soumettre manuellement.

source: A new option allows to update settings from idp attributes on login.
fr: Une nouvelle option permet de mettre à jour les options à partir des attributs idp lors de la connexion.

source: A new option allows to config a specific idp and to use the federation certificates of it.
fr: Une nouvelle option permet d’utiliser les certificats de la fédération pour la configuration de l’idp.

source: A new option allows to improve the security measures. You should go to the {link}config form{link_end} to confirm them.
fr: Une nouvelle option permet de renforcer les mesures de sécurité. Vous pouvez les confirmer dans la {link}configuration{link_end}.

source: For security, the default role cannot be an admin one. The default role was set to {role}.
fr: Par sécurité, le rôle par défaut ne peut pas être un rôle administrateur. Le rôle par défaut a été mis à {role}.

source: An IdP does not have url and no id and is not valid.
fr: Un IdP ne dispose pas d’url ni d’identifiant et n’est pas valide.

source: The idp "{url}" was manually filled and is not checked neither updated.
fr: L’IdP « {url} » a été rempli manuellement et n’est ni vérifié ni mis à jour.

source: The option to use metadata from federation for IdP "{url}" is set, but there is no such data.
fr: L’option pour utiliser les métadonnées de la fédération pour l’IdP « {url} » est définie, mais les données n’existent pas.

source: The metadata for IdP "{url}" could not be retrieved.
fr: Les métadonnées de l’IdP « {url} » ne peuvent pas être récupérées.

source: The idp "{url}" seems to be invalid and has no id.
fr: L’IdP « {url} » semble incorrect et n’a pas d’identifiant.

source: A path is set for the certificate ({use}), but it does not contain a directory "certs" with files "sp.crt" and "sp.key".
fr: Un chemin est défini pour le certificat ({use}), mais il ne contient pas le dossier « certs » avec les fichiers « sp.crt » et « sp.key ».

source: The SP public certificate is set, but not the private key ({use}).
fr: Le certificat public du SP est défini, mais pas la clé privée ({use}).

source: The SP private key is set, but not the public certificate ({use}).
fr: La clé privée du SP est définie, mais pas le certificat public ({use}).

source: You cannot set a path to the certificate ({use}) and provide them in fields at the same time.
fr: Vous ne pouvez pas indiquer le chemin du certificat ({use}) et l’indiquer dans les champs en même temps.

source: The certicate ({use}) cannot be created when fields "certificate path", "x509 certificate", or "x509 private key" are filled.
fr: Le certificat ({use}) ne peut pas être créé quand les champs « chemin du certificat », « certificat x509 » ou « clé privée x509 » sont définis.

source: The x509 certificate ({use}) was created successfully.
fr: Le certificat x509 ({use}) a été créé correctement.

source: An error occurred during creation of the x509 certificate ({use}): {msg}
fr: Une erreur est survenue lors de la création du certificat x509 ({use}) : {msg}

source: The SP public certificate ({use}) is not valid.
fr: Le certificat public du SP ({use}) n’est pas valide.

source: The SP private key ({use}) is not valid.
fr: La clé privée du SP ({use}) n’est pas valide.

source: Unable to encrypt message with SP public certificate ({use}).
fr: Impossible de chiffrer le message avec le certificat public SP ({use}).

source: Unable to decrypt message with SP private key ({use}).
fr: Impossible de déchiffrer le message avec la clé privée du SP ({use}).

source: An issue occurred during decryption with SP private key ({use}). It may not the good one.
fr: Un problème s’est produit lors du déchiffrement avec la clé privée SP ({use}). Il se peut qu’elle ne soit pas la bonne.

source: No issue found on SP public certificate and private key ({use}).
fr: Aucun problème n’a été constaté pour le certificat public et la clé privée du SP ({use}).

source: The IdP public certificate of "{url}" is not valid.
fr: Le certificat public de l’IdP « {url} » est incorrect.

source: Unable to encrypt message with IdP public certificate of "{url}".
fr: Impossible de chiffrer le message avec le certificat public IdP de « {url} ».

source: No issue found on IdP public certificate of "{url}".
fr: Aucun problème n’a été détecté sur le certificat public de « {url} ».

source: The federation url "{url}" is not a valid url.
fr: L’url de la fédération « {url} » n'est pas valide.

source: The local federation file "{file}" does not exist or is not readable.
fr: Le fichier local pour la fédération {file} n’existe pas ou n’est pas accessible.

source: The federation url {url} does not return any metadata.
fr: L’url de la fédération {url} ne renvoie aucune métadonnée.

source: The federation url {url} does not return valid xml metadata.
fr: L’url de la fédération {url} ne renvoie pas de métadonnées xml valides.

source: The IdP url "{url}" is not valid.
fr: L’url de l’IdP « {url} » n’est pas valide.

source: The IdP url {url} does not return any metadata.
fr: L’url de l’IdP {url} ne renvoie aucune métadonnée.

source: The IdP url {url} does not return valid xml metadata.
fr: L’url IdP {url} ne renvoie pas de métadonnées xml valides.

source: Active services
fr: Services actifs

source: Urls for SSO and SLS should be provided if enabled.
fr: Les urls pour SSO et SLS doivent être fournies si le service est activé.

source: Log in (SSO)
fr: Connexion (SSO)

source: Log out (SLS)
fr: Déconnexion (SLS)

source: Register (JIT)
fr: Enregistrement (JIT)

source: Update user name
fr: Mettre à jour le nom de l’utilisateur

source: Update user settings
fr: Mettre à jour les options utilisateur

source: Default role for new users when not configured in idp
fr: Rôle par défaut pour les nouveaux utilisateurs s’il n’est pas configuré par l’idp

source: Groups
fr: Groupes

source: Default Groups given to newly created users using the Group Module
fr: Groupes par défaut définis pour les nouveaux utilisateurs (module Groupe)

source: Append idp links to login view
fr: Ajouter les liens IdP à la vue de connexion

source: The list of idps can be displayed on any page via the theme block and helper or via module Guest.
fr: La liste des idps peut être affichée sur n’importe quelle page via le bloc de thème et du view helper ou via le module Guest.

source: Links
fr: Liens

source: Buttons
fr: Boutons

source: Select
fr: Menu déroulant

source: Default redirect page after login
fr: Page de redirection par défaut après connexion

source: Set "home" for home page (admin or public), "site" for the current site home, "top" for main public page, "me" for guest account, or any path starting with "/", including "/" itself for main home page.
fr: Indiquer « home » pour la page d’accueil (admin ou public), « site » pour l’accueil du site actuel, « top » pour l’accueil du site principal, « me » pour le compte utilisateur, ou tout chemin commençant par « / », y compris « / » pour la page d’accueil principale.

source: Set a specific service provider entity id (default is the uri of the current host)
fr: Définir un id d’entité spécifique pour le fournisseur de services (uri du serveur par défaut)

source: Replace host name when SP is behind a proxy
fr: Remplacer le nom d’hôte quand le SP est derrière un proxy

source: This option allows to replace the host domain used by Omeka as internal SP server with the host name used in public. The protocol (http or https) should be included.
fr: Cette option permet de remplacer le domaine hôte utilisé par Omeka en tant que serveur SP interne par le nom d’hôte utilisé en public. Le protocole (http ou https) doit être indiqué.

source: Metadata content type
fr: Type de contenu des métadonnées

source: Some IdP require response header content type to be simple xml.
fr: Certains IdP exigent que le type de contenu de l’en-tête de réponse soit un simple xml.

source: Metadata content disposition
fr: Disposition du contenu des métadonnées

source: Some IdP require metadata to be downloadable, not inline.
fr: Certains IdP exigent que les métadonnées soient téléchargeables et non en ligne.

source: Inline (display in browser)
fr: Inline (affichage dans le navigateur)

source: Attachment (download in browser)
fr: Pièce jointe (télécharger dans le navigateur)

source: Undefined
fr: Indéfini

source: Metadata mode
fr: Mode des métadonnées

source: Some IdP don’t manage xml prefixes in metadata, so they may be removed.
fr: Certains IdP ne gèrent pas les préfixes xml dans les métadonnées, ils peuvent donc être supprimés.

source: Basic (xml metadata without prefixes)
fr: Basique (métadonnées xml sans préfixes)

source: Format of the name ID
fr: Format de l’id du nom

source: Value to set in xml element `<md:NameIDFormat>`. Let empty to use the default value (unspecified).
fr: Valeur à définir dans l’élément xml `<md:NameIDFormat>`. Laisser vide pour utiliser la valeur par défaut (non-spécifiée).

source: Select name id format if needed
fr: Choisir le format de l’id du nom si besoin

source: Disable a security measure when an IdP does not support it, for example "Sign assertions" for Renater. Conversely, some federations require some security measures, for example "Sign assertions" for Kantara.
fr: Désactiver une mesure de sécurité quand l’IdP ne la gère pas, par exemple "Signer les assertions" pour Renater. Inversement, certaines fédérations demandent certaines mesures, par exemple "Signer les assertions" pour Kantara.

source: SP: Sign metadata with certificate below
fr: SP : Signer les métadonnées avec le certificat ci-dessous

source: SP: Sign auth request messages with certificate below
fr: SP : Signer les messages de requêtes de connexion avec le certificat ci-dessous

source: SP: Sign logout request messages with certificate below
fr: SP : Signer les messages de requêtes de déconnexion avec le certificat ci-dessous

source: SP: Sign logout response messages with certificate below
fr: SP : Signer les messages de réponse de déconnexion avec le certificat ci-dessous

source: SP: Encrypt Name ID of logout request with certificate below
fr: SP : Chiffrer l’id du nom dans la requête de déconnexion avec le certificat ci-dessous

source: Requirement for IdP: Sign response, logout request and response
fr: Obligation de l’IdP : Signer les réponses et les requêtes et réponses de déconnexion

source: Requirement for IdP: Sign assertions
fr: Obligation de l’IdP : Signer les assertions

source: Requirement for IdP: Encrypt assertions
fr: Obligation de l’IdP : Chiffrer les assertions

source: Requirement for IdP: Include Name ID in response
fr: Obligation de l’IdP : Inclure l’id du nom dans la réponse

source: Requirement for IdP: Encrypt Name ID
fr: Obligation de l’IdP : Chiffrer l’id du nom

source: Check signatures: Manage compatibility with Microsoft ADFS
fr: Vérifier les signatures : Gérer la compatibilité avec Microsoft ADFS

source: Path for SP signing certificates (outside of webserver or protected)
fr: Chemin d’accès aux certificats de signature SP (en dehors du serveur web ou protégé)

source: Some idp require certificates. If needed and not set in next fields, set the path to it. It should contains a directory "certs/" with at least "sp.crt" and "sp.key". It must be protected, for example with a .htaccess. Take care to renew them when needed.
fr: Certains IDP nécessitent des certificats. Si besoin et non défini dans les champs suivants, le chemin d’accès peut être indiqué ici. Il doit contenir un répertoire « certs/ » avec au moins « sp.crt » « sp.key ». Il doit être protégé, par exemple avec un .htaccess. Veillez à les renouveler lorsque cela est nécessaire.

source: SP public signing certificate (x509)
fr: Certificat public de signature du SP (x509)

source: Some idp require certificates. If needed and if not set via a path, paste public certificate here. Take care to renew them when needed.
fr: Certains IDP nécessitent des certificats. Si besoin et non défini via un fichier, collez le certificat public ici. Veillez à les renouveler si nécessaire.

source: SP signing private key (x509)
fr: Clé privée de signature du SP (x509)

source: Some idp require certificates. If needed and not set via a path, paste private key here. Take care to renew them when needed.
fr: Certains IDP nécessitent des certificats. Si besoin et non définie via un fichier, vous pouvez coller la clé privée ici. Veillez à les renouveler lorsque cela est nécessaire.

source: Create an x509 certificate for the SP signature (require the three previous fields be empty)
fr: Créer un certificat x509 pour la signature du SP (si les trois champs précédents sont vides)

source: The certificate is generated for a century with the default data of the server or the data below.
fr: Le certificat est créé pour un siècle avec les données par défaut du serveur ou les valeurs ci-dessous.

source: Data to store in the signing certificate to create (optional)
fr: Valeurs à enregistrer dans le certificat de signature à créer (facultatif)

source: The optional data keys are: countryName, stateOrProvinceName, localityName, organizationName, organizationalUnitName, commonName, and emailAddress.
fr: Les clés de données possibles sont : countryName, stateOrProvinceName, localityName, organizationName, organizationalUnitName, commonName et emailAddress.

source: Path for SP encryption certificates (outside of webserver or protected)
fr: Chemin d’accès aux certificats de chiffrement SP (en dehors du serveur web ou protégé)

source: SP encryption public certificate (x509)
fr: Certificat public de chiffrement du SP (x509)

source: SP encryption private key (x509)
fr: Clé privée de chiffrement du SP (x509)

source: Create a, x509 certificate for the SP encryption (require the three previous fields be empty)
fr: Créer un certificat x509 pour le chiffrement du SP (si les trois champs précédents sont vides)

source: Data to store in the crypting certificate to create (optional)
fr: Valeurs à enregistrer dans le certificat de chiffrement à créer (facultatif)

source: Federation
fr: Fédération

source: Select a federation…
fr: Choisir une fédération…

source: Identity providers (IdP)
fr: Fournisseurs d’identité (IdP)

source: Add an idp
fr: Ajouter un idp

source: Include default login link
fr: Inclure le lien de connexion par défaut

source: Input element
fr: Élément de saisie

source: Automatic
fr: Automatique

source: Update mode
fr: Mode de mise à jour

source: Automatic (set the url below and data will be automatically filled, checked and updated)
fr: Automatique (définir l’url ci-dessous et les données seront automatiquement remplies, vérifiées et mises à jour)

source: Manual (not recommended when the certificate has a short expiration date)
fr: Manuel (non recommandé quand le certificat a une date d’expiration proche)

source: Use the metadata provided by the federation
fr: Utiliser les métadonnées de la fédération

source: Skip update of the entity id (fix possible issue with reverse proxies)
fr: Ignorer la mise à jour de l’identifiant de l’entité (résout un problème avec les proxys inverses)

source: IdP metadata url (allow to get and update settings automatically)
fr: Url des métadonnées de l’IdP (permet d'obtenir et de mettre à jour les paramètres automatiquement)

source: For Shibboleth, it may be "https://idp.example.org/idp/shibboleth".
fr: Pour Shibboleth, cela peut être « https://idp.example.org/idp/shibboleth ».

source: IdP Entity Id
fr: Id de l’entité IdP

source: Generally, the id is the same than the url of the idp. This is the attribute `entityID` of xml element `<md:EntityDescriptor>`, for example "https://idp.example.org/sso". For some IdP, the url scheme must not be set, so try "idp.example.org" too.
fr: Généralement, l’id est le même que l’url de l’idp. C’est l’attribut `entityID` de l'élément xml `<md:EntityDescriptor>`, par exemple « https://idp.example.org/sso ». Pour certains IdP, le schéma ne doit pas être défini, essayez donc aussi « idp.example.org ».

source: IdP name
fr: Nom de l’IdP

source: Url of the IdP single sign-on (SSO) service endpoint
fr: Url du service d’authentification unique (SSO) de l’IdP

source: Full url set in attribute `Location` of xml element `<SingleSignOnService Binding="urn:oasis:names:tc:SAML:2.0:bindings:HTTP-Redirect">`, for example "https://idp.example.org/idp/profile/SAML2/Redirect/SSO".
fr: URL complète définie dans l'attribut `Location` de l'élément xml `<SingleSignOnService Binding="urn:oasis:names:tc:SAML:2.0:bindings:HTTP-Redirect">`, par exemple « https://idp.example.org/idp/profile/SAML2/Redirect/SSO ».

source: Url of the IdP single log out (SLO) service endpoint
fr: Url du point d’extrémité du service de déconnexion unique (SLO) de l’IdP

source: Full url set in attribute `Location` of xml element `<SingleLogoutService Binding="urn:oasis:names:tc:SAML:2.0:bindings:HTTP-Redirect">`, for example "https://idp.example.org/idp/profile/SAML2/Redirect/SLO".
fr: URL complète définie dans l’attribut `Location` de l’élément xml `<SingleLogoutService Binding="urn:oasis:names:tc:SAML:2.0:bindings:HTTP-Redirect">`, par exemple « https://idp.example.org/idp/profile/SAML2/Redirect/SLO ».

source: Public X.509 certificate of the IdP (first, signing)
fr: Certificat public X.509 de l’IdP (premier, signature)

source: If not set, it will be fetched from the IdP url, if available.
fr: Si elle n’est pas définie, elle sera extraite de l’url de l’IdP, si disponible.

source: Public X.509 certificate of the IdP (first, encryption)
fr: Certificat public X.509 de l’IdP (premier, chiffrement)

source: Attributes map between IdP and Omeka
fr: Alignement des valeurs entre l’IdP et Omeka

source: Format: IdP attribute = Omeka key or user setting. IdP keys can be the canonical or friendly ones. Managed Omeka keys are "email", "name" and "role". Other options, like "locale", "singlesignon_xxx", "userprofile_yyy", are stored in user settings.
fr: Format : attribut IdP = Clé ou option utilisateur Omeka. Les clés IdP peuvent être canoniques ou simplifiées. Les clés Omeka gérées sont « email », « name » et « role ». Les autres options, comme « locale », « singlesignon_xxx », « userprofile_yyy », sont stockées dans les paramètres utilisateur.

source: Roles map between IdP and Omeka
fr: Alignement entre les rôles IdP et Omeka
