Repository: Daniel-KM/Omeka-S-module-SingleSignOn
Catalog: language/*.po
Languages: fr

source: Format: IdP role = Omeka role. It allows to get a more precise role than the default "researcher" or "guest". For security, admin roles are disabled: update the user manually once created.
fr: Format : IdP rôle = Omeka rôle. Cela permet d’obtenir un rôle plus précis que le rôle par défaut « chercheur » ou « invité ». Pour des raisons de sécurité, les rôles d'administrateur sont désactivés : mettez l'utilisateur à jour manuellement une fois qu'il a été créé.

source: Static user settings for new users
fr: Paramètres d'utilisateur statiques pour les nouveaux utilisateurs

source: Format: Omeka user setting key = value.
fr: Format: option utilisateur Omeka = valeur.

source: Attributes to hide in user account page
fr: Attributs à cacher dans la page utilisateur

source: Allow to hide some attributes for security or privacy. Separe multiple attributes with a space.
fr: Permet de cacher certains attributs par sécurité ou rgpd. Séparer les attributs par des espaces.

source: Remove this idp
fr: Supprimer cet idp

source: Move this idp up
fr: Déplacer cet idp vers le haut

source: Move this idp down
fr: Déplacer cet idp vers le bas

source: No IdP with this name.
fr: Aucun IdP avec ce nom.

source: Single sign-on is disabled.
fr: Le service SSO est désactivé.

source: Single sign-on failed: {errors}. {error_last}
fr: Le service SSO a échoué : {errors}. {error_last}

source: Single sign-on failed: {errors}
fr: Le service SSO a échoué : {errors}

source: No email provided to log in or register.
fr: Aucun courriel n’est fourni pour se connecter ou s’enregistrer.

source: No email provided or mapped. Available canonical attributes for this IdP: {keys}. Available friendly attributes for this IdP: {keys_2}.
fr: Pas d’email fourni ou aligné. Attributs canoniques disponibles pour cet IdP : {keys}. Attributs simplifiés disponibles pour cet IdP : {keys_2}.

source: Automatic registering is disabled.
fr: L’inscription automatique est désactivée.

source: No name provided or mapped. Available canonical attributes for this IdP: {keys}. Available friendly attributes for this IdP: {keys_2}.
fr: Pas de nom fourni ou aligné. Attributs canoniques disponibles pour cet IdP : {keys}. Attributs simplifiés disponibles pour cet IdP : {keys_2}.

source: User "{email}" is inactive.
fr: L’utilisateur « {email} » est inactif.

source: Successfully logged in.
fr: Connecté avec succès.

source: Single logout service failed: {errors}. {error_last}
fr: Le service SLO de déconnexion a échoué : {errors}. {error_last}

source: Single logout service failed: {errors}
fr: Le service SLO de déconnexion a échoué : {errors}

source: Successfully logged out.
fr: Déconnecté avec succès.

source: The IdP "{idp}" has no available metadata.
fr: L’IdP « {idp} » n’a pas de métadonnées disponibles.

source: The IdP "{idp}" has no valid xml metadata.
fr: L’IdP « {idp} » n’a pas de métadonnées xml valides.

source: SSO service has an error in configuration: {exception}
fr: Le service SSO a une erreur de configuration : {exception}

source: SSO service is not available. Ask admin to config it.
fr: Le service SSO n’est pas disponible. Demander à votre administrateur de le configurer.

source: SSO service is unavailable.
fr: Le service SSO est indisponible.

source: SSO service is unavailable. Ask admin to config it.
fr: Le service SSO est indisponible. Demander à votre administrateur de le configurer.

source: The cerificate for the signature is incomplete.
fr: Le certificat pour la signature est incomplet.

source: The cerificate for the encryption is incomplete.
fr: Le certificat pour le chiffrement est incomplet.

source: Single sign-on login links
fr: Liens de connexion SSO
